## Plan Result (dev-frontdoor)




<pre><code>Plan: 42 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.frontdoor_for_testing_migration.azurerm_frontdoor.main
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;darts-portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dev-casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dev-certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dev-courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;dev-immigrationappealsonline&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;jd-bureau&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;jd-public&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;portal-dev&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-test-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web-pr-1955&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_custom_https_configuration.https[&#34;vh-video-web-reform&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;darts-portal&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-casetracker&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-certificatedbailiffs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-courtfines&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-immigrationappealsonline&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-admin-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-care-standards&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-cicap&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-employment-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-finance-tax&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-immigration-svcs&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-info-rights&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-land-reg-division&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-lands-chamber&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-tansport-appeals&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;jd-bureau&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;jd-public&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;portal-dev&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web-pr-1955&#34;]
  * module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web-reform&#34;]
  * module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontdoor_for_testing_migration.azurerm_frontdoor.main will be created
  + resource "azurerm_frontdoor" "main" {
      + backend_pool_health_probes           = (known after apply)
      + backend_pool_load_balancing_settings = (known after apply)
      + backend_pools                        = (known after apply)
      + cname                                = (known after apply)
      + explicit_resource_order              = (known after apply)
      + friendly_name                        = "hmcts-test-sbox"
      + frontend_endpoints                   = (known after apply)
      + header_frontdoor_id                  = (known after apply)
      + id                                   = (known after apply)
      + load_balancer_enabled                = true
      + name                                 = "hmcts-test-sbox"
      + resource_group_name                  = "lz-dev-rg"
      + routing_rules                        = (known after apply)
      + tags                                 = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + backend_pool {
          + health_probe_name   = "defaultHealthProbe"
          + id                  = (known after apply)
          + load_balancing_name = "defaultLoadBalancing"
          + name                = "defaultBackend"

          + backend {
              + address     = "www.bing.com"
              + enabled     = true
              + host_header = "www.bing.com"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-toffee"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-toffee"
          + name                = "toffee"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "toffee.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-jd-bureau"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-jd-bureau"
          + name                = "jd-bureau"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "jdbureau.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-jd-public"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-jd-public"
          + name                = "jd-public"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "jdfrontend.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-test-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-test-web"
          + name                = "vh-test-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-test-web.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-video-web"
          + name                = "vh-video-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-video-web.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web-reform"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-video-web-reform"
          + name                = "vh-video-web-reform"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-video-web-dev.hearings.reform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-video-web-pr-1955"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-video-web-pr-1955"
          + name                = "vh-video-web-pr-1955"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-video-web-pr-1955.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-vh-admin-web"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-vh-admin-web"
          + name                = "vh-admin-web"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "vh-admin-web.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-portal-dev"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-portal-dev"
          + name                = "portal-dev"

          + backend {
              + address     = "pre-dev.powerappsportals.com"
              + enabled     = true
              + host_header = "portal-dev.pre-recorded-evidence.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-casetracker"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-casetracker"
          + name                = "dev-casetracker"

          + backend {
              + address     = "civil-loadb-y5o7jqurq76d-2065714619.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.casetracker.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-certificatedbailiffs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-certificatedbailiffs"
          + name                = "dev-certificatedbailiffs"

          + backend {
              + address     = "certi-loadb-a49bsydpgeb7-1204811385.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.certificatedbailiffs.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-courtfines"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-courtfines"
          + name                = "dev-courtfines"

          + backend {
              + address     = "court-loadb-118vi6sleq8ii-1970392396.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.courtfines.direct.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-immigrationappealsonline"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-immigrationappealsonline"
          + name                = "dev-immigrationappealsonline"

          + backend {
              + address     = "iacfe-loadb-p3eli3f0pz30-1245399594.eu-west-2.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.immigrationappealsonline.justice.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-sds-api-mgmt"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-sds-api-mgmt"
          + name                = "sds-api-mgmt"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsapimgmtdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "sds-api-mgmt.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-land-reg-division"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-land-reg-division"
          + name                = "dev-trib-land-reg-division"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.landregistrationdivision.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-immigration-svcs"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-immigration-svcs"
          + name                = "dev-trib-immigration-svcs"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.immigrationservices.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-info-rights"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-info-rights"
          + name                = "dev-trib-info-rights"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.informationrights.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-admin-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-admin-appeals"
          + name                = "dev-trib-admin-appeals"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.administrativeappeals.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-care-standards"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-care-standards"
          + name                = "dev-trib-care-standards"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.carestandards.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-lands-chamber"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-lands-chamber"
          + name                = "dev-trib-lands-chamber"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.landschamber.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-finance-tax"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-finance-tax"
          + name                = "dev-trib-finance-tax"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.financeandtax.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-employment-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-employment-appeals"
          + name                = "dev-trib-employment-appeals"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.employmentappeals.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-tansport-appeals"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-tansport-appeals"
          + name                = "dev-trib-tansport-appeals"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.transportappeals.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-dev-trib-cicap"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-dev-trib-cicap"
          + name                = "dev-trib-cicap"

          + backend {
              + address     = "dts-tribs-dev-317402065.eu-west-1.elb.amazonaws.com"
              + enabled     = true
              + host_header = "dev.cicap.dsd.io"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }
      + backend_pool {
          + health_probe_name   = "healthProbeSettings-darts-portal"
          + id                  = (known after apply)
          + load_balancing_name = "loadBalancingSettings-darts-portal"
          + name                = "darts-portal"

          + backend {
              + address     = "firewall-nonprodi-palo-sdsdev.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "darts-portal.dev.platform.hmcts.net"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "defaultHealthProbe"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-toffee"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-jd-bureau"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-jd-public"
          + path                = "/"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-vh-test-web"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }
      + backend_pool_health_probe {
          + enabled             = true
          + id                  = (known after apply)
          + interval_in_secon

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

              + action  = "Block"
                  + enabled = false
                  + rule_id = "942300"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942290"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942280"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942270"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942260"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942250"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942240"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942230"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942220"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942210"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942200"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942190"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942180"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942170"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942160"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942150"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942140"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942120"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942110"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942100"
                }
            }
          + override {
              + rule_group_name = "XSS"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941350"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941340"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941330"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941320"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941310"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941300"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941290"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941280"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941270"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941260"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941250"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941240"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941230"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941220"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941210"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941200"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941190"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941180"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941170"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941160"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941150"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941140"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941130"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941120"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941110"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941101"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "941100"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["jd-public"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Detection"
      + name                  = "jdpublicsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "IPMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "81.134.202.29/32",
                  + "51.145.6.230/32",
                  + "194.33.192.0/25",
                  + "51.149.249.0/27",
                  + "194.33.196.0/25",
                  + "51.149.249.32/27",
                  + "195.59.75.0/24",
                  + "158.234.251.0/24",
                  + "158.234.250.0/24",
                  + "213.121.161.124/32",
                  + "51.145.4.100/32",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "IPMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["portal-dev"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "portaldevsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + custom_rule {
          + action                         = "Block"
          + enabled                        = true
          + name                           = "CountryMatchWhitelist"
          + priority                       = 1
          + rate_limit_duration_in_minutes = 1
          + rate_limit_threshold           = 10
          + type                           = "MatchRule"

          + match_condition {
              + match_values       = [
                  + "GB",
                ]
              + match_variable     = "RemoteAddr"
              + negation_condition = true
              + operator           = "GeoMatch"
            }
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + override {
              + rule_group_name = "RCE"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932100"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932110"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "932115"
                }
            }
          + override {
              + rule_group_name = "SQLI"

              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942440"
                }
              + rule {
                  + action  = "Block"
                  + enabled = false
                  + rule_id = "942450"
                }
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "sdsapimgmtsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["toffee"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "toffeesbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhadminwebsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhtestwebsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web-pr-1955"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebpr1955sbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_frontdoor_firewall_policy.custom["vh-video-web-reform"] will be created
  + resource "azurerm_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + mode                  = "Prevention"
      + name                  = "vhvideowebreformsbox"
      + resource_group_name   = "lz-dev-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + managed_rule {
          + type    = "DefaultRuleSet"
          + version = "1.0"

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
        }
    }

  # module.frontdoor_for_testing_migration.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "fd-log-analytics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "FrontdoorAccessLog"

          + retention_policy {
              + days    = 7
              + enabled = true
            }
        }
      + enabled_log {
          + category = "FrontdoorWebApplicationFirewallLog"

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true

          + retention_policy {
              + days    = 30
              + enabled = true
            }
        }
    }

Plan: 42 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":475,"Program":"tfcmt","SHA1":"","Target":"dev-frontdoor","Vars":{}} -->